## Imports

In [1]:
import numpy as np
import pandas as pd

In [35]:
kaggle_data = pd.read_csv("../dados/amazon.csv", sep=',', engine="python")
inpe_data = pd.read_csv("../dados/Focos_2017-01-01_2017-12-31.csv", sep=',', encoding='utf-8', engine="python")

In [36]:
inpe_data.columns

Index(['datahora', 'satelite', 'pais', 'estado', 'municipio', 'bioma',
       'diasemchuva', 'precipitacao', 'riscofogo', 'latitude', 'longitude',
       'frp'],
      dtype='object')

In [37]:
kaggle_data.columns

Index(['year', 'state', 'month', 'number', 'date'], dtype='object')

In [44]:
kaggle_data.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

In [46]:
def convert_timestamp_to_month(value):
    timestamp = str(value)
    return int(timestamp.split('/')[1])
    
def convert_timestamp_to_year(value):
    timestamp = str(value)
    return int(timestamp.split('/')[0])
    
inpe_data['month'] = inpe_data['datahora'].map(convert_timestamp_to_month)
inpe_data['year'] = inpe_data['datahora'].map(convert_timestamp_to_year)

In [47]:
inpe_data.head()

,datahora,satelite,pais,estado,municipio,bioma,diasemchuva,precipitacao,riscofogo,latitude,longitude,frp,month,year
0,2017/12/19 16:47:00,AQUA_M-T,Brasil,PARA,PICARRA,Amazonia,0,8.5,0.0,-6.453,-49.067,NaN,12,2017
1,2017/12/20 17:31:00,AQUA_M-T,Brasil,AMAZONAS,NHAMUNDA,Amazonia,0,1.3,0.1,-2.264,-56.747,NaN,12,2017
2,2017/12/20 17:31:00,AQUA_M-T,Brasil,PARA,ALMEIRIM,Amazonia,0,2.4,0.2,-1.051,-53.082,NaN,12,2017
3,2017/12/20 17:31:00,AQUA_M-T,Brasil,PARA,ALENQUER,Amazonia,0,0.5,0.1,-1.722,-54.867,NaN,12,2017
4,2017/12/20 17:31:00,AQUA_M-T,Brasil,PARA,ALENQUER,Amazonia,0,0.6,0.0,-1.912,-54.532,NaN,12,2017

In [65]:
para_2017_01 = kaggle_data.loc[kaggle_data['year'] == 2017].loc[kaggle_data['month'] == 'Janeiro'].loc[kaggle_data['state'] == "Amazonas"]

In [66]:
para_2017_01.head()

     year     state    month  number        date
737  2017  Amazonas  Janeiro    65.0  2017-01-01

In [67]:
para_2017_01_inpe = inpe_data.loc[inpe_data['year'] == 2017].loc[inpe_data['month'] == 1].loc[inpe_data['estado'] == "AMAZONAS"]

In [68]:
len(para_2017_01_inpe)

62